<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"91a616cd744a132d1b60cbf8debd48ea17990d27238f53fd05b28cb64576f1db","plan_job_ref":"Job Run Terraform plan in staging #9 at https://github.com/GSA-TTS/review-repro/actions/runs/12712017149","plan_out_hash":"e5e34ea5984bcaa49dff1ac1f6a9e4663c6021e82b86eb296f1a6734a12564b8","plan_hash":"588d13440b8b1fa878cfafcbab1daba3e98a676ce0d3454be9434c4476aaa933","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudfoundry_app.app will be created
+   resource "cloudfoundry_app" "app" {
+       buildpacks                  = [
+           "ruby_buildpack",
        ]
+       created_at                  = (known after apply)
+       disk_quota                  = (known after apply)
+       environment                 = {
+           "RAILS_ENV"                = "staging"
+           "RAILS_LOG_TO_STDOUT"      = "true"
+           "RAILS_MASTER_KEY"         = (sensitive value)
+           "RAILS_SERVE_STATIC_FILES" = "true"
        }
+       health_check_type           = (known after apply)
+       id                          = (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
+       name                        = "review_repro-staging"
+       org_name                    = "gsa-tts-devtools-prototyping"
+       path                        = "./dist/src.zip"
+       processes                   = [
+           {
+               command                     = "./bin/rake cf:on_first_instance db:migrate && exec env HTTP_PORT=$PORT ./bin/thrust ./bin/rails server"
+               disk_quota                  = (known after apply)
+               health_check_type           = (known after apply)
+               instances                   = 1
+               log_rate_limit_per_second   = (known after apply)
+               memory                      = "256M"
+               readiness_health_check_type = (known after apply)
+               type                        = "web"
            },
        ]
+       readiness_health_check_type = (known after apply)
+       routes                      = [
+           {
+               protocol = (known after apply)
+               route    = "review_repro-staging.app.cloud.gov"
            },
        ]
+       service_bindings            = [
+           {
+               service_instance = "review_repro-rds-staging"
            },
        ]
+       source_code_hash            = "T1y76jt3W2QE09TXqezU3FGShRFh5ktUuMnoLhgvLSs="
+       space_name                  = "review-repro-stage"
+       stack                       = (known after apply)
+       strategy                    = "blue-green"
+       updated_at                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #9](https://github.com/GSA-TTS/review-repro/actions/runs/12712017149)